STk> (define x (list 1 2 3))
x
STk> (define y (list 4 5 6))
y
STk> (append x y)
(1 2 3 4 5 6)
STk> (cons x y)
((1 2 3) 4 5 6)
STk> (list x y)
((1 2 3) (4 5 6))